import { DateUtil, formatHourMM, toCambodiaTime } from "src/app/utils/date.util"

export const TELEGRAM_MESSAGE = (param: any = {}) => {
    return {
        PHONE_NUMBER_CHOICE     : `ជម្រើសលេខភ្ជាប់គណនី`
        , TELEGRAM_PHONE_NUMBER : `លេខ Telegram នេះ`
        , LAUNCH_APP            : '🚀 បើកកម្មវិធី'
        , OTHER_PHONE_NUMBER    : `លេខទូរសព្ទផ្សេង...`
        , UPDATE_SUCCESSFULLY   : `ធ្វើបច្ចុប្បន្នភាពបានជោគជ័យ!`

        , START : "HRM BOT គឺជាសេវា Telegram សម្រាប់តាមដានវត្តមានផ្ទាល់ខ្លួនរបស់មន្ត្រីរាជការម្នាក់ៗ\n\n" +
                "ខាងក្រោមជារបៀបប្រើប្រាស់ ៖\n" +
                "• ចុច /activate ដើម្បីភ្ជាប់គណនីប្រើប្រាស់របស់អ្នក\n" +
                "សូមអរគុណ!\n"

        , ACTIVATE_FAILED : "🔴 មិនជោគជ័យ! ការចុះឈ្មោះរបស់លោកអ្នកមិនទទួលបានជោគជ័យ\n\n"+
                        "- លេខទូរសព្ទរបស់អ្នក "+ (param.phoneNumber ?? '') + " មិនត្រឹមត្រូវនឹងលេខទូរសព្ទក្នុងប្រព័ន្ធ\n"+
                        "- សូមធ្វើការផ្ទៀងផ្ទាត់ព័ត៌មានរបស់អ្នក ជាមួយមន្ត្រីគ្រប់គ្រងព័ត៌មានមន្ត្រីរាជការ\n\n"+
                        "រៀបចំដោយ៖ ក្រុមការងារបច្ចេកទេស\n\n"+
                        'សូមអរគុណ !!'

        , INVALID_SESSION : "🔴 មិនជោគជ័យ! ការចុះឈ្មោះរបស់លោកអ្នកមិនទទួលបានជោគជ័យ\n\n"+
                        "- កូដសម្ងាត់ភ្ជាប់តេលេក្រាមរបស់អ្នកមិនត្រឹមត្រូវ\n"+
                        "- សូមធ្វើការផ្ទៀងផ្ទាត់ព័ត៌មានរបស់អ្នក ជាមួយមន្ត្រីគ្រប់គ្រងព័ត៌មានមន្ត្រីរាជការ\n\n"+
                        "រៀបចំដោយ៖ ក្រុមការងារបច្ចេកទេស\n\n"+
                        'សូមអរគុណ !!'

        , ACTIVATE_SUCCESS : "🟢«អបអរសាទរ! ការចុះឈ្មោះរបស់លោកអ្នកទទួលបានជោគជ័យ»\n\n" +
                        "ឈ្មោះ\t: "    + (param.name_kh ?? "") + "\n" +
                        "អង្គភាព\t: " + (param.org ?? "") + "\n" +
                        "តួនាទី\t: "   + (param.position ?? "")+ "\n\n" +
                        "ចុច /help ដើម្បីមើលអំពីរបៀបនៃការប្រើប្រាស់។\n" +
                        "ចុច Menu ដើម្បីជ្រើសរើសប្រភេទរបាយការណ៍។\n\n" +
                        "រៀបចំដោយ៖ ក្រុមការងារបច្ចេកទេស\n\n" +
                        "សូមអរគុណ!\n"

        , HELP_ACTIVE_USER : "HRM BOT គឺជាសេវា Telegram សម្រាប់តាមដានវត្តមានផ្ទាល់ខ្លួនរបស់មន្ត្រីរាជការម្នាក់ៗ\n\n"
                    + "ខាងក្រោមជារបៀបប្រើប្រាស់ ៖\n"
                    + (param.commands || []).map(cm => {
                        return `• ចុច /${cm.command} ដើម្បី${cm.full_description}`;
                    }).join('\n') + '\n'
                    + "សូមអរគុណ!\n"
        
        , DEACTIVATE : "⬅️🚪 «លោកអ្នកបានផ្តាច់ការប្រើប្រាស់ តេឡេក្រាមប្រព័ន្ធគ្រប់គ្រងបុគ្គលិក»\n\n" +
                    "ដើម្បីចាប់ផ្តើមសារជាថ្មីសូមចុច៖\n" +
                    "/start ចាប់ផ្តើម\n" +
                    "/help [រកជំនួយ]\n\n" +
                    "រៀបចំដោយ៖ ក្រុមការងារបច្ចេកទេស\n\n" +
                    "សូមអរគុណ!\n" 

        , INVALID_COMMAND : "ការបញ្ចូលមិនត្រឺមត្រូវ\n\n" +
                            "ចុច /help ដើម្បីមើលអំពីរបៀបនៃការប្រើប្រាស់\n" +
                            "សូមអរគុណ!\n"

        , UNAUTHORIZED : "អ្នកមិនមានសិទ្ធិធ្វើសកម្មភាពនេះទេ\n\n"
                        + "ចុច /help ដើម្បីមើលអំពីរបៀបនៃការប្រើប្រាស់\n"
                        + "សូមអរគុណ!\n"

        , ERROR : "សូមមេត្តាអធ្យាស្រ័យ ប្រព័ន្ធមានការរអាក់រអួល\n" +
                "ក្រុមការងារបច្ចេកទេសប្រព័ន្ធនឹងដោះស្រាយឆាប់ៗនេះ៕ \n\n" +
                DateUtil.formatBasicDate(toCambodiaTime(new Date())) + "\n" +
                "សូមអរគុណ!\n"

        , FOOTER : `ឈ្មោះ : ${param.name_kh}\n`
                + `អង្គភាព : ${param.department}\n`
        // , FOOTER : "- ម៉ោងការងារ:\n"
        //         + "\t\t+ 8h/day\n"
        //         + "\t\t+ 5days/week\n"
        //         + "\t\t+ សូមស្កេនចូលចាប់ពីម៉ោង 06:00 និងស្កេនចេញឲ្យបានមុនម៉ោង 22:00\n"
        //         + "\t\t+ ម៉ោងសម្រាកអាហារថ្ងៃត្រង់គិតចាប់ពីម៉ោង 12:00 រហូតដល់ម៉ោង 14:00, នឹងមិនរាប់បញ្ចូល\n\n"
        //         + `ឈ្មោះ : ${param.name_kh}\n`
        //         + `អង្គភាព : ${param.department}\n`

        , USER_ATTENDANT_BY_DATE :
            "វត្តមានប្រចាំថ្ងៃ\n"
            + `#${param.datetime}\n\n`
            + `សរុបម៉ោង: ${param.working_hour} ${param.icon}\n`
            + `* សម្គាល់: ម៉ោងទទួលបានពី ${param.attendent_code}\n\n`
            + `កំណត់ត្រាពេលវេលាក្នុងប្រព័ន្ធ\n`
            + `\t\t+ ស្កេនតំបូង    : ${param.check_in}\n`
            + `\t\t+ ស្កេនចុងក្រោយ : ${param.check_out}\n`

        , ID_CARD : "បណ្ណសម្គាល់ខ្លួនមន្រ្តី:\n"
                + `\t\t+ ឈ្មោះ : ${param.name_kh}\n`
                + `\t\t+ 📅 បច្ចុប្បន្នភាព : ${param.date}\n`

        , FILE : `${param.name}\n`
                + `\t\t+ 📅 បច្ចុប្បន្នភាព : ${param.date}\n`
        
        , USER_NOTIFICATION : `🔔 សារជួនតំណឹង: ${param.title}\n`
                + (param.topic ? `- ${param.topic}\n` : '')
        , USER_REQUEST_NOTIFICATION: `
🔔 ${param.requester_name} ${param.action_title}
🗓 ${param.date_range} (${param.num_day}ថ្ងៃ)
📄 ${param.objective}

🟠 រង់ចាំ ${param.pending_reviwer} ត្រួតពិនិត្យ
`.trim()

        , USER_APPROVE_REQUEST_NOTIFICATION: `
🔔 ${param.requester_name} ${param.action_title}
🗓 ${param.date_range} (${param.num_day}ថ្ងៃ)
📄 ${param.objective}

🟠 រង់ចាំ ${param.pending_approver} អនុម័ត
`.trim()

        , USER_APPROVED_REQUEST_NOTIFICATION: `
🔔 ${param.requester_name} ${param.action_title}
🗓 ${param.date_range} (${param.num_day}ថ្ងៃ)
📄 ${param.objective}

✅ សំណើរបស់ ${param.requester_name} ត្រូវបានអនុម័ត
`.trim()

        , USER_REJECTED_REQUEST_NOTIFICATION: `
🔔 ${param.requester_name} ${param.action_title}
🗓 ${param.date_range} (${param.num_day}ថ្ងៃ)
📄 ${param.objective}

❌ សំណើរបស់ ${param.requester_name} ត្រូវបានបដិសេធ
`.trim()


        , PICK_OPTIONS : 'សូមជ្រើសរើសជម្រើសខាងក្រោម៖'
        , NOT_YET_CHECK_IN : 'អ្នកមិនទាន់បានស្កេនចូលនៅឡើយទេ សូមធ្វើការស្កេនចូល‼️'
    }
}